marticervia/WuR-CTC-Demo-EFR32MG12/wur-implementation.c
void emberBackbonePrefixHandler(const uint8_t *prefix,
                                uint8_t prefixLengthInBits,
                                bool available)
{
  uint8_t prefixLengthInBytes = (prefixLengthInBits >> 3)
                                + ((prefixLengthInBits & 0x07) ? 1 : 0);

  emberAfAppPrintln("bbr prefix: ");
  emberAfAppDebugExec(emberAfPrintIpv6Prefix((const EmberIpv6Address *) prefix, prefixLengthInBits));
  emberAfAppPrintln(" | %p", available ? "available" : "unavailable");
  if (available) {
    // Choose a unique DUA every time.
    EmberIpv6Address dua = { { 0 } };
    MEMCOPY(dua.bytes, prefix, prefixLengthInBytes);
    MEMCOPY(dua.bytes + 8, emMeshLocalIdentifier, 8);
    dua.bytes[15] += 1;
    emberRequestDomainUniqueAddress(dua.bytes, EMBER_IPV6_BITS);
  }
}

void emberMulticastListenerHandler(const EmberIpv6Address * multicastGroupAddress)
{
  emberAfAppPrint("Subscribed to off-mesh multicast group ");
  emberAfAppDebugExec(emberAfPrintIpv6Address(multicastGroupAddress));
  emberAfAppPrintln("");
}


void emberZclPostAttributeChangeCallback(EmberZclEndpointId_t endpointId,
                                         const EmberZclClusterSpec_t *clusterSpec,
                                         EmberZclAttributeId_t attributeId,
                                         const void *buffer,
                                         size_t bufferLength)
{
  // This callback is called whenever an attribute changes.  When the OnOff
  // attribute changes, we toggle our LED accordingly.

  if (emberZclAreClusterSpecsEqual(&emberZclClusterOnOffServerSpec, clusterSpec)
      && attributeId == EMBER_ZCL_CLUSTER_ON_OFF_SERVER_ATTRIBUTE_ON_OFF) {
    bool on = *((bool *)buffer);
    (on ? halSetLed : halClearLed)(BOARD_ACTIVITY_LED);
  }
}

void emberZclGetDefaultReportingConfigurationCallback(EmberZclEndpointId_t endpointId,
                                                      const EmberZclClusterSpec_t *clusterSpec,
                                                      EmberZclReportingConfiguration_t *configuration)
{
  // We have reportable attributes in the On/Off and Level Control servers.

  if (emberZclAreClusterSpecsEqual(&emberZclClusterOnOffServerSpec,
                                   clusterSpec)) {
    configuration->minimumIntervalS =  1;
    configuration->maximumIntervalS = 60;
  } else if (emberZclAreClusterSpecsEqual(&emberZclClusterLevelControlServerSpec,
                                          clusterSpec)) {
    configuration->minimumIntervalS = 10;
    configuration->maximumIntervalS = 60;
  }
}

void emberZclGetDefaultReportableChangeCallback(EmberZclEndpointId_t endpointId,
                                                const EmberZclClusterSpec_t *clusterSpec,
                                                EmberZclAttributeId_t attributeId,
                                                void *buffer,
                                                size_t bufferLength)
{
}

void emberZclIdentifyServerStartIdentifyingCallback(uint16_t identifyTimeS)
{
  // This callback is called whenever the endpoint should identify itself.  The
  // identification procedure is application specific, and could be implemented
  // by blinking an LED, playing a sound, or displaying a message.

  emberAfCorePrintln("Identifying...");
}

void emberZclIdentifyServerStopIdentifyingCallback(void)
{
  // This callback is called whenever the endpoint should stop identifying
  // itself.

  emberAfCorePrintln("Identified");
}

void halButtonIsr(uint8_t button, uint8_t state)
{
  // Buttons can be used to bind to a switch.  Pressing both buttons will cause
  // the node to start EZ Mode commissioning to find other nodes on the
  // network.  If other nodes implement clusters that correspond to ours (e.g.,
  // we have the On/Off server and they have the On/Off client) and they are
  // also in EZ Mode, we will create a binding to them and they will create a
  // binding to us.

  bool thisPressed = (state == BUTTON_PRESSED);
  bool otherPressed = (halButtonState(button == BUTTON0 ? BUTTON1 : BUTTON0)
                       == BUTTON_PRESSED);
  waitingForReleased = waitingForReleased && (thisPressed || otherPressed);

  if (thisPressed && otherPressed && !waitingForReleased) {
    emberEventControlSetActive(ezModeEventControl);
    waitingForReleased = true;
  }
}

void ezModeEventHandler(void)
{
  emberEventControlSetInactive(ezModeEventControl);
  emberZclStartEzMode();
}

void initAdcRNG(void){
	   uint32_t i;

	   /* Enable ADC Clock */
	   CMU_ClockEnable(cmuClock_ADC0, true);
	   ADC_Init_TypeDef init = ADC_INIT_DEFAULT;
	   ADC_InitSingle_TypeDef singleInit = ADC_INITSINGLE_DEFAULT;

	   /* Initialize the ADC with the required values */
	   init.timebase = ADC_TimebaseCalc(0);
	   init.prescale = ADC_PrescaleCalc(7000000, 0);
	   ADC_Init(ADC0, &init);

	   /* Initialize for single conversion specific to RNG */
	   singleInit.reference = adcRefVEntropy;
	   singleInit.diff = true;
	   singleInit.posSel = adcPosSelVSS;
	   singleInit.negSel = adcNegSelVSS;
	   ADC_InitSingle(ADC0, &singleInit);

	   /* Set VINATT to maximum value and clear FIFO */
	   ADC0->SINGLECTRLX |= _ADC_SINGLECTRLX_VINATT_MASK;
	   ADC0->SINGLEFIFOCLEAR = ADC_SINGLEFIFOCLEAR_SINGLEFIFOCLEAR;
}

uint8_t adcRngGetByte(void)
{
   uint32_t i;
   uint8_t random= 0;

   /* Enable ADC Clock */
   /* Random number generation */
   for (i=0; i<3; i++)
   {
      ADC_Start(ADC0, adcStartSingle);
      while ((ADC0->IF & ADC_IF_SINGLE) == 0);
      random |= ((ADC_DataSingleGet(ADC0) & 0x07) << (i *3));
   }

   return random;
}

void efr_fill_random(uint8_t* buffer, uint16_t buffer_len){
	uint32_t i;

	for(i = 0; i < buffer_len; i++){
		buffer[i] = adcRngGetByte();
	}
}

static app_ctxt_t app_ctxt;
static test_ctxt_t test_ctxt;

static void init_test_context(test_ctxt_t* ctxt){
    ctxt->start_timestamp = halCommonGetInt32uMillisecondTick();
    ctxt->finish_timestamp = 0;
    ctxt->current_frame = 0;
    ctxt->total_frames = TOTAL_TEST_FRAMES;
    ctxt->KO_frames= 0;
    ctxt->OK_frames = 0;
    ctxt->test_status = TEST_IN_PROGRESS;
    memset(ctxt->failure_reason, 0, TEST_REASON_LEN);
}

static void generate_test_frame(uint8_t* buffer, uint16_t req_len_bytes){
    efr_fill_random(buffer, req_len_bytes);
}

static void fail_test_context(test_ctxt_t* ctxt, char* reason, uint32_t fail_timestamp){
    ctxt->test_status = TEST_FAILED;
    strcpy(ctxt->failure_reason, reason);
    ctxt->finish_timestamp = fail_timestamp;
    emberAfCorePrintln("[%u]: Finished test with failure on frame: %u/%u !\n", fail_timestamp, test_ctxt.current_frame, test_ctxt.total_frames);
    emberAfCorePrintln("[%u]: Test run in %u milliseconds!\n", fail_timestamp, test_ctxt.finish_timestamp - test_ctxt.start_timestamp);
    app_ctxt.app_status = APP_IDLE;

