marticervia/WuR-CTC-Demo-EFR32MG12/wur-implementation.c
}

static void aprove_test_context(test_ctxt_t* ctxt, uint32_t success_timestamp){
    ctxt->test_status = TEST_FINISHED;
    ctxt->finish_timestamp = success_timestamp;
    emberAfCorePrintln("[%u]: Finished test with results: %u/%u !\n", success_timestamp, test_ctxt.OK_frames, test_ctxt.total_frames);
    emberAfCorePrintln("[%u]: Test run in %u milliseconds!\n", success_timestamp, test_ctxt.finish_timestamp - test_ctxt.start_timestamp);
    uint32_t bitrate = (test_ctxt.OK_frames * TEST_FRAME_SIZE * 8* 1000) / ((test_ctxt.finish_timestamp - test_ctxt.start_timestamp));
    emberAfCorePrintln("[%u]: Calculated bitrate is: %u !\n", success_timestamp, bitrate);
    app_ctxt.app_status = APP_IDLE;
}


static void update_text_context(test_ctxt_t* ctxt, bool OK_result){
    ctxt->current_frame++;
    if(OK_result){
        ctxt->OK_frames++;
    }
    else{
        ctxt->KO_frames++;
    }
    if(ctxt->current_frame == ctxt->total_frames){
        aprove_test_context(ctxt, halCommonGetInt32uMillisecondTick());
    }
}

/* wur related handlers */
void WuRTestStartDevice(EmberCoapCode code,
					 uint8_t *uri,
					 EmberCoapReadOptions *options,
					 const uint8_t *payload,
					 uint16_t payloadLength,
					 const EmberCoapRequestInfo *info){
	emberAfCorePrintln("Received /test/start request");

    if(test_ctxt.test_status == TEST_IN_PROGRESS){
		emberCoapRespondWithCode(info, EMBER_COAP_CODE_412_PRECONDITION_FAILED);
		return;
    }

    init_test_context(&test_ctxt);
	emberAfCorePrintln("Init test context");
    app_ctxt.app_status = TEST_SENDING_WAKE;
	emberCoapRespondWithCode(info, EMBER_COAP_CODE_203_VALID);
}

void WuRTestStatusDevice(EmberCoapCode code,
					 uint8_t *uri,
					 EmberCoapReadOptions *options,
					 const uint8_t *payload,
					 uint16_t payloadLength,
					 const EmberCoapRequestInfo *info){

	uint8_t resp_payload[TEST_STATUS_PAYLOAD_LEN];
	uint16_t u16_tmp_val;
	uint32_t u32_tmp_val;
	emberAfCorePrintln("Received /test/status request");

    /*
     * 1. Copy the test status.
     */
    resp_payload[0] = (uint8_t) test_ctxt.test_status;
    /*
     * 2. Copy the test current frame.
     */
    u16_tmp_val = htons(test_ctxt.current_frame);
    memcpy(resp_payload, &u16_tmp_val, TEST_STATUS_PAYLOAD_OFFSET_CURR_FRAME);
    /*
     * 3. Copy the total test frame.
     */
    u16_tmp_val = htons(test_ctxt.total_frames);
    memcpy(resp_payload, &u16_tmp_val, TEST_STATUS_PAYLOAD_OFFSET_TOTAL_FRAME);
    /*
     * 4. Copy the OK frame count.
     */
    u16_tmp_val = htons(test_ctxt.OK_frames);
    memcpy(resp_payload, &u16_tmp_val, TEST_STATUS_PAYLOAD_OFFSET_OK_FRAME);
    /*
     * 5. Copy the KO frame count.
     */
    u16_tmp_val = htons(test_ctxt.KO_frames);
    memcpy(resp_payload, &u16_tmp_val, TEST_STATUS_PAYLOAD_OFFSET_KO_FRAME);
    /*
     * 6. Copy the timestamp.
     */
    if(test_ctxt.finish_timestamp != 0){
    	u32_tmp_val = HTONL(test_ctxt.finish_timestamp - test_ctxt.start_timestamp);
    }
    else{
    	u32_tmp_val = 0;
    }
    memcpy(resp_payload, &u32_tmp_val, TEST_STATUS_PAYLOAD_OFFSET_RUNTIME);

	 emberCoapRespondWithPayload(&app_ctxt.app_request_info, EMBER_COAP_CODE_203_VALID,
			 resp_payload, TEST_STATUS_PAYLOAD_LEN);
}


void WuRWakeDevice(EmberCoapCode code,
					 uint8_t *uri,
					 EmberCoapReadOptions *options,
					 const uint8_t *payload,
					 uint16_t payloadLength,
					 const EmberCoapRequestInfo *info){

	uint32_t current_timestamp = halCommonGetInt32uMillisecondTick();
	emberAfCorePrintln("[%d]: Got Wake Device REQ!", current_timestamp);

	if(app_ctxt.app_status != APP_IDLE){
		emberAfCorePrintln("[%d]: Refusing Wake Device REQ, already busy!", current_timestamp);
		emberCoapRespondWithCode(info, EMBER_COAP_CODE_412_PRECONDITION_FAILED);
		return;
	}

	if((payloadLength > MAX_APP_DATA_BUF) || (payloadLength < MIN_WAKE_REQ_LEN)){
		emberAfCorePrintln("[%d]: Payload of %d bytes disallowed for WAKE!", current_timestamp, payloadLength);
		emberCoapRespondWithCode(info, EMBER_COAP_CODE_400_BAD_REQUEST);
		return;
	}

	/* retrieve data*/
	memcpy(app_ctxt.app_data_buf, payload, payloadLength);
	app_ctxt.app_data_buf_len = payloadLength;

	/* change status and notify main loop */
	emberSaveRequestInfo(info, &(app_ctxt.app_request_info));
	app_ctxt.app_status = APP_SENDING_WAKE;
}

void WuRRequestDevice(EmberCoapCode code,
						 uint8_t *uri,
						 EmberCoapReadOptions *options,
						 const uint8_t *payload,
						 uint16_t payloadLength,
						 const EmberCoapRequestInfo *info){
	uint32_t current_timestamp = halCommonGetInt32uMillisecondTick();
	emberAfCorePrintln("[%d]: Got Data Device REQ!", current_timestamp);

	if(app_ctxt.app_status != APP_IDLE){
		emberAfCorePrintln("[%d]: Refusing DATA to Device REQ, already busy!", current_timestamp);
		emberCoapRespondWithCode(info, EMBER_COAP_CODE_412_PRECONDITION_FAILED);
		return;
	}

	if((payloadLength > MAX_APP_DATA_BUF) || (payloadLength < MIN_DATA_REQ_LEN)){
		emberAfCorePrintln("[%d]: Payload of %d bytes disallowed for DATA!", current_timestamp, payloadLength);
		emberCoapRespondWithCode(info, EMBER_COAP_CODE_400_BAD_REQUEST);
		return;
	}

	/* retrieve data*/
	memcpy(app_ctxt.app_data_buf, payload, payloadLength);
	app_ctxt.app_data_buf_len = payloadLength;

	/* change status and notify main loop */
	emberSaveRequestInfo(info, &(app_ctxt.app_request_info));
	app_ctxt.app_status = APP_SENDING_DATA;
}


static inline uint16_t _getuint16t(uint8_t* buff){
	uint16_t wur_addr;
	memcpy(&wur_addr, buff, sizeof(uint16_t));
	wur_addr = NTOHS(wur_addr);
	return wur_addr;
}

static inline void _setint16t(uint8_t* buff, int16_t num){
	num = HTONS(num);
	memcpy(buff, &num, sizeof(int16_t));
}

static void _respondWithError(app_trans_result_t res){
	const uint8_t res_payload[2] = {0};
	_setint16t((uint8_t*) res_payload, res);
	 emberCoapRespondWithPayload(&app_ctxt.app_request_info, EMBER_COAP_CODE_500_INTERNAL_SERVER_ERROR,
			res_payload, 2);
}

static void _respondWithPayload(uint8_t* payload, uint8_t payload_len){
	if(payload_len > 0){
		 emberCoapRespondWithPayload(&app_ctxt.app_request_info, EMBER_COAP_CODE_203_VALID,
				 &payload[WUR_PAYLOAD_OFFSET], payload_len - WUR_PAYLOAD_OFFSET);
	}
	emberCoapRespondWithCode(&app_ctxt.app_request_info, EMBER_COAP_CODE_203_VALID);
}


static void _printBuffer(uint8_t* res, uint8_t res_length){
	uint16_t i;
	emberAfCorePrintln("Buffer is:");

	for(i=0; i < (res_length -1); i++){
		emberAfCorePrint("%01X:", res[i]);
	}
	emberAfCorePrintln("%01X", res[i]);
}

static void _wur_tx_cb(wur_tx_res_t tx_res){
	uint32_t current_timestamp = halCommonGetInt32uMillisecondTick();

