marticervia/WuR-CTC-Demo-EFR32MG12/wur-implementation.c
	switch(app_ctxt.app_status){
		case APP_WAITING_WAKE:
		case APP_WAITING_DATA:
			if(tx_res == WUR_ERROR_TX_OK){
				if(app_ctxt.app_status == APP_WAITING_WAKE){
					//emberAfCorePrintln("[%d]: Going to respond to Wake!", current_timestamp);
					app_ctxt.app_status = APP_RESPONDING_WAKE;

				}
				else{
					//emberAfCorePrintln("[%d]: Going to respond to Data!", current_timestamp);
					app_ctxt.app_status = APP_RESPONDING_DATA;
				}
				memset(app_ctxt.app_data_buf, 0, MAX_APP_DATA_BUF);
				app_ctxt.app_data_buf_len = 0;
			}
			else if((tx_res ==  WUR_ERROR_TX_ACK_DATA_TIMEOUT)
					|| (tx_res ==  WUR_ERROR_TX_ACK_WAKE_TIMEOUT)){
				emberAfCorePrintln("[%d]: Received Timeout, going to idle!", current_timestamp);
				app_ctxt.app_status = APP_IDLE;
				_respondWithError(APP_TRANS_KO_TIMEOUT);
			}
			else{
				emberAfCorePrintln("[%d]: Received Error, going to idle!", current_timestamp);
				app_ctxt.app_status = APP_IDLE;
				_respondWithError(APP_TRANS_KO_TIMEOUT);
			}
			break;
        case TEST_WAITING_WAKE:
            if(tx_res == WUR_ERROR_TX_OK){
                app_ctxt.app_status = TEST_GENERATE_FRAME;
            }
            else{
                app_ctxt.app_status = TEST_COMPLETE_FAILURE;
            }
            break;
        case TEST_WAIT_FRAME:
            if(tx_res == WUR_ERROR_TX_OK){
                //printf("[%d]: Received ACK!\n", current_timestamp);
                app_ctxt.app_status = TEST_COMPLETE_OK_FRAME;
            }
            else if(tx_res == WUR_ERROR_TX_ACK_DATA_TIMEOUT){
                //printf("[%d]: Received NACK!\n", current_timestamp);
                app_ctxt.app_status = TEST_COMPLETE_KO_FRAME;
            }
            else{
                //printf("[%d]: Received Error!\n", current_timestamp);
                app_ctxt.app_status = TEST_COMPLETE_FAILURE;
            }
            memset(app_ctxt.app_data_buf, 0, MAX_APP_DATA_BUF);
            app_ctxt.app_data_buf_len = 0;
            break;
		default:
			emberAfCorePrintln("[%d]: Received ACK while not waiting. Is this an error?!", current_timestamp);
			break;
	}
}


static void _wur_rx_cb(wur_rx_res_t rx_res, uint8_t* rx_bytes, uint8_t rx_bytes_len){
	uint32_t current_timestamp = halCommonGetInt32uMillisecondTick();

	//emberAfCorePrintln("[%d]: Received response with status %d!", current_timestamp, rx_res);
	//_printBuffer(rx_bytes, rx_bytes_len);
	if(rx_bytes_len > MAX_APP_DATA_BUF){
		emberAfCorePrintln("[%d]: Received response above max frame size %d!", current_timestamp);
	}
	memcpy(app_ctxt.app_data_buf, rx_bytes, rx_bytes_len);
	app_ctxt.app_data_buf_len = rx_bytes_len;
}


void WuRInitApp(void){
	wur_init(WUR_ADDR);

	memset(&app_ctxt.app_request_info, 0, sizeof(EmberCoapRequestInfo));
	app_ctxt.app_status = APP_IDLE;
	memset(app_ctxt.app_data_buf, 0, MAX_APP_DATA_BUF);
	app_ctxt.app_data_buf_len = 0;
	wur_set_tx_cb(_wur_tx_cb);
	wur_set_rx_cb(_wur_rx_cb);
	initAdcRNG();
}

uint8_t test_data_buf[TEST_FRAME_SIZE];

void WuRAppTick(void){

	uint32_t current_timestamp = halCommonGetInt32uMillisecondTick();
	uint16_t wur_addr, wake_ms;
	wur_tx_res_t tx_res;

	wur_tick(current_timestamp);

	switch(app_ctxt.app_status){
		case APP_IDLE:
			if(current_timestamp % 10000 == 0){
				emberAfCorePrintln("[%d]: Device IDLE", current_timestamp);
			}
			break;
		case APP_SENDING_WAKE:
			//emberAfCorePrintln("[%d]: Sending Wake Device REQ!", current_timestamp);
			wur_addr = _getuint16t(app_ctxt.app_data_buf);
			wur_addr = wur_addr & 0x03FF;
			wake_ms = _getuint16t(&app_ctxt.app_data_buf[PAYLOAD_OFFSET]);

			tx_res = wur_send_wake(wur_addr, wake_ms);
			if(tx_res != WUR_ERROR_TX_OK){
				emberAfCorePrintln("[%d]: Failure to send Wake Device REQ!", current_timestamp);
				_respondWithError(APP_TRANS_KO_TX);
				app_ctxt.app_status = APP_IDLE;
				break;
			}
			app_ctxt.app_status = APP_WAITING_WAKE;
			break;
		case APP_SENDING_DATA:
			//emberAfCorePrintln("[%d]: Sending Data to Device REQ!", current_timestamp);
			wur_addr = _getuint16t(app_ctxt.app_data_buf);
			wur_addr = wur_addr & 0x03FF;
			tx_res = wur_send_data(wur_addr, &app_ctxt.app_data_buf[PAYLOAD_OFFSET], app_ctxt.app_data_buf_len - PAYLOAD_OFFSET, false, -1);
			if(tx_res != WUR_ERROR_TX_OK){
				emberAfCorePrintln("[%d]: Failure to send Data to Device REQ!", current_timestamp);
				_respondWithError(APP_TRANS_KO_TX);
				app_ctxt.app_status = APP_IDLE;
				break;
			}
			app_ctxt.app_status = APP_WAITING_DATA;
			break;
		case APP_WAITING_WAKE:
		case APP_WAITING_DATA:
			/* wait for the OK/KO Tx callback to change the state*/
			if(current_timestamp % 500 == 0){
				emberAfCorePrintln("[%d]: Device Waiting ACK", current_timestamp);
			}
			break;
		case APP_RESPONDING_WAKE:
			//emberAfCorePrintln("[%d]: Sending Response to Wake Device REQ!", current_timestamp);
			_respondWithPayload(NULL, 0);
			app_ctxt.app_status = APP_IDLE;
			break;
		case APP_RESPONDING_DATA:
			//emberAfCorePrintln("[%d]: Sending Response to Data to Device REQ!", current_timestamp);
			_respondWithPayload(app_ctxt.app_data_buf, app_ctxt.app_data_buf_len );
			app_ctxt.app_status = APP_IDLE;
			break;

        case TEST_SENDING_WAKE:
        	emberAfCorePrintln("Sending wake request");

            //printf("[%d]: Sending Test Wake Device REQ!\n", current_timestamp);
            wur_addr = TEST_ADDR & (0x03FF);
            wake_ms = TEST_WAKE_INTERVAL;

            app_ctxt.app_status = TEST_WAITING_WAKE;
            tx_res = wur_send_wake(wur_addr, wake_ms);
            if(tx_res != WUR_ERROR_TX_OK){
            	emberAfCorePrintln("[%d]: Failure to send Wake Device REQ!\n", current_timestamp);
                _respondWithError(APP_TRANS_KO_TX);
                app_ctxt.app_status = TEST_COMPLETE_FAILURE;
                break;
            }
            emberAfCorePrintln("[%d]: Sent Test Wake Device REQ!\n", current_timestamp);
            break;

        case TEST_WAITING_WAKE:
            emberAfCorePrintln("Waiting frame!");
            break;


        case TEST_GENERATE_FRAME:
            emberAfCorePrintln("Generating frame!");
            generate_test_frame(test_data_buf, TEST_FRAME_SIZE);
            app_ctxt.app_status = TEST_SEND_FRAME;
            break;

        case TEST_SEND_FRAME:
        	emberAfCorePrintln("[%d]: Sending Data to Device test, frame %d/%d!\n", current_timestamp, test_ctxt.current_frame, test_ctxt.total_frames);
            wur_addr = TEST_ADDR & (0x03FF);
            app_ctxt.app_status = TEST_WAIT_FRAME;
            tx_res = wur_send_data(wur_addr, (uint8_t*)&test_data_buf, TEST_FRAME_SIZE, false, -1);
            if(tx_res != WUR_ERROR_TX_OK){
            	emberAfCorePrintln("[%d]: Failure to send Data to Device REQ!\n", current_timestamp);
                update_text_context(&test_ctxt, false);
                app_ctxt.app_status = TEST_GENERATE_FRAME;
            }
            emberAfCorePrintln("[%d]: Sent Test Data Device REQ!\n", current_timestamp);
            break;

        case TEST_WAIT_FRAME:
            //printf("Wait Frame!");
            break;

        case TEST_COMPLETE_OK_FRAME:
        	emberAfCorePrintln("Frame sent OK!");
            update_text_context(&test_ctxt, true);
            if(test_ctxt.test_status == TEST_IN_PROGRESS){
                //printf("Prepare next frame!");
                app_ctxt.app_status = TEST_GENERATE_FRAME;
            }
            break;
        case TEST_COMPLETE_KO_FRAME:
        	emberAfCorePrintln("Frame sent KO!");
            update_text_context(&test_ctxt, false);
            if(test_ctxt.test_status == TEST_IN_PROGRESS){
                //printf("Prepare next frame!");
                app_ctxt.app_status = TEST_GENERATE_FRAME;
            }
            break;
        case TEST_COMPLETE_FAILURE:
        	emberAfCorePrintln("Test failure!");
            fail_test_context(&test_ctxt, "Error while taking the test.\n", current_timestamp);
            app_ctxt.app_status = APP_IDLE;
            break;
		default:
			break;
	}
}



void stateEventHandler(void)
{
  emberEventControlSetInactive(stateEventControl);

  switch (state) {
    case RESUME_NETWORK:
      resumeNetwork();
      break;
    case COMMISSION_NETWORK:
      commissionNetwork();
      break;
    case JOIN_COMMISSIONED:
      joinCommissioned();
      break;
    case RESET_NETWORK_STATE:
      resetNetworkState();
      break;
    default:
      assert(false);
      break;
  }
}

static void setNextState(uint8_t nextState)
{
  state = nextState;
  emberEventControlSetActive(stateEventControl);
}
